[
"NothingToday, I realized that I'm on the top of not having my drivers license/ state ID (I was submitting my taxes and needed it) I also threw away my brand new passport because I thought it was trash in my boyfriends car.",
"Today, we are once again in full COVID lockdown. I live in a tiny apartment, I'm pregnant and the only thing that helps me sleep is walking for an hour...",
"Today, I walked out the back door of my place of employment and looked down to see a huge cockroach. This is quite a normal occurrence, so I thought nothing of it until I realized it was struggling to drag the corpse of one of its friends into the building.",
"Today, I hit a deer. The worst part? Papa deer saw me hit mama deer, and proceded to ram into my car.",
"Today, I was reviewing for a major nursing school exam I have this week. I panicked because none of the material seemed familiar, and figured that I must've missed something during class and now had to catch up. After 4 hours, I finally realized that I'd been studying from the wrong textbook.",
"Today, I sliced a deep gash into my thumb while carving up bagels. After putting a plaster on, I returned to my room to relax, where I lit a candle. The flame from my new lighter shot up, and set fire to the plaster on my thumb. Now I have a cut AND several burns.",
"Today, my boyfriend gave me acne cream for my birthday.",
"Today, a woman yelled at me for hurting her. I'm a tattoo artist.",
"Loud fartToday, I was accidentally scared my one year-old son with my huge, smelly fart that was really loud. He now won't come near me without crying.",
"Today, I asked my boyfriend why he didn't believe in marriage. His response was, \"I believe in marriage. Just not marriage with you.\"",
"Today, I was babysitting. The kid said he had to use the bathroom. When I told him to go ahead, he said he just did. He was on my lap. He wasn't wearing pants.",
"Today, my therapist told me to write down my secrets in an envelope and symbolically burn them. My secrets included stories of my rampant sex life, drug use, a suicide attempt, and the overpowering hatred I have for my family. I've managed to misplace the envelope somewhere back home.",
"Today, my PE teacher yelled at me for not trying hard enough in class. This my second week back after being in the hospital with a collapsed lung.",
"Today, I wore a cute new striped shirt to work. One of my co-workers said to me \"I like your shirt. Most fat people don't look good in horizontals.\"",
"Today, I asked a girl I like to homecoming. I brought her to my house beforehand for dinner with my family. My brother asked her whether we were just friends or dating, she shouts \"Just friends!\" and then starts flirting with him with me in the room.",
"Today, I got fired from my job at a weight-loss center because I was too skinny, and apparently it's too depressing for the customers to handle.",
"Today, I tried to give my husband a striptease for his birthday. I wound up tripping over my own panties and nearly dislocating my shoulder.",
"Today, my girlfriend came back from her mission trip with hickies all over her boobs. She said it wasn't cheating because she was doing God's work and that they canceled each other out.",
"Today, after telling my parents that I want to be a vegetarian, I got grounded. Apparently, \"black people can't be vegetarians\" and, I'm \"crazy for even suggesting something like that.\"",
"Today, I went on a date with a cute guy I met at a bookstore. He stood up and said he was leaving when I said that I didn't like 50 Shades of Grey, because he, \"doesn't want to be near a bitch who doesn't know her place\". He then told me to give him a ride home.",
"Today, I found out that I'm pregnant. I had an IUD put in two years ago that's supposed to prevent pregnancy. To put it in perspective, less than 1% of people using this IUD get pregnant. Lucky me.",
"Today, my fiancée called our engagement off, because apparently she's actually a complete idiot who will believe anything that a slimy con artist tells her. In this case, a \"psychic\" who mumbled some shit about me having \"a dark aura.\"",
"Today, we are once again in full COVID lockdown. I live in a tiny apartment, I'm pregnant and the only thing that helps me sleep is walking for an hour...",
"Today, I found my vibrator that I didn't know was missing... underneath my dad's mattress.",
"Today, I was once again passed over for a promotion. I'm now the assistant to a kid who has failed to meet almost every single responsibility he's been given before. It's my job to make sure he's successful, and if he isn't, I'll lose my job.",
"Today, 3 hours into a 7-hour flight, I only ate half the chocolate mousse that came with my meal and decided to give the rest to my boyfriend. While reaching for his tray, he mistook the action as me stealing his mousse. We spent the rest of the flight covered in sticky soft drink splatter.",
"Today, it's been six months since my husband and I have miscarried our daughter who we named Hana Grace. My sister just revealed she is having a girl and naming her Hana Grace since \"the name is up for grabs now\".",
"TMI",
"Know your worthToday, my girlfriend broke up with me, because I was apparently \"too good\" for her.",
"Today, I was taking a dump, when my dad shouted for me to go wash the dishes. Fed up with his constant shit, I told him to bite me. He took this as an invitation to wedge the bathroom door shut for nearly two hours, despite all my pleas and apologies.",
"Today, I was supposed to go on a date with a guy I really like. My friends convinced me that he was going to stand me up and that I should just stay home to avoid being hurt. He showed up; I didn't. My friends laughed at my gullible nature.",
"Today, at the yacht club I work at a girl ordered a Portabella wrap. She asked for no cheese or veggies, just the Portabellas. After she got the sandwich and ate half of it, she sent it back saying she didn't know it had mushrooms in it.",
"The old switcherooToday, I was unable to go on my dream vacation because I thought I'd lost my passport. Feeling incredibly stupid, I had no choice but to watch my plane depart without me. Shortly after, my brother handed me passport, saying that since I wasn't going on my trip, I could use my refund to pay for his cat's surgery. My trip was non-refundable.",
"Today, I walked into my bathroom, only to find my dad passed out on the floor with his pants around his ankles.",
"Today, as I left the supermarket, I found someone had hit my car in the parking lot. There was a note tucked under the wipers. Insurance details? Nope. It just said \"Sorry dude. I fucked up. Good luck with the car.\" Great.",
" Today, my father-in-law decided to \"fix\" our bathtub and ended up flooding the bathroom. Later, in his attempt to clean things up, he walked, without permission,...",
"Today, with one week left until I fly to my new apartment, movers loaded my belongings and happily drove off. They even loaded my unpacked, inflated air mattress. Looks like I'm sleeping on the floor for a week.",
"Today, I got so anxious while trying to fight the ticket I got earlier this month that I passed out in front of the judge.",
"Today, I had to call in sick to work because I was experiencing bowel distress. I called my manager's phone directly so no one else would know of my embarrassment. She put me on speakerphone, and I only realized when the juvenile laughter started.",
"MisunderstandingToday, my boss sent me to remove a tree from a client's home. So I went and cut down the tree, only for my boss to show up an hour later, speechless. I was supposed to remove a sapling that had sprouted through the driveway tarmac, not the 100-year-old prizewinning Japanese cherry tree.",
"Today, I went to a football sleepover with all of my teammates. I felt something near the bottom of my sleeping bag, and I pulled it up with my foot. My entire team watched me pull out a red thong. My parents had been on a camping trip the week before.",
" Today, my boyfriend and I had sex for the first time. I started stroking the back of his neck with both of my hands. He told me, \"Your hands are nice and smooth like my grandmother's.\"",
"Today, after picking up my 6 year old from school, he says, \"Drew said his dad could beat you up.\" I told him that he needs to respect his own father more and stand up for me! I get home, look up his class roster and low and behold, Drew's dad beat me up in Jr. High.",
"Today, my wife of over 20 years told me she wants a divorce because she wants \"a change in life\". She has had the same mullet hair cut since '84.",
"Today, I let a friend read a draft of the novel I'm writing. She claimed the antagonist is blatantly based on her, and threatened to sue me if I don't pay her royalties. The antagonist is an ancient, insane goblin witch. I guess I see now how this confusion could arise.",
"Today, I realized I've been driving for almost two years and still get excited when I park between the lines on my first try.",
"Today, I had a job interview. The interviewer asked me to give 5 adjectives describing myself. I listed 7. The last one being \"listener.\"",
"Noisy lover Today, the new heart medication I take makes it hard for me to get an erection. It also gives me gas. My wife is getting sick of me farting when we're finally able to screw.",
"Today, after supporting QLD in the State of Origin for the last 20 years of my life, I found out that I was actually born in NSW.",
"Today, my allergies are killing me. I took a Benadryl to help, but the allergies are still here. I'm now chugging Mountain Dew at 9:30 in the morning to keep from falling asleep at my desk. Thanks for nothing Benadryl.",
" Today, my father-in-law decided to \"fix\" our bathtub and ended up flooding the bathroom. Later, in his attempt to clean things up, he walked, without permission,...",
"Today, I broke my fifth bone in three years. While I'd like say that they've all been scary, athletic injuries, most have been from attempting to do things as mundane as walking.",
"ReliefToday, our 9-year-old daughter was removed from our home and placed into a home for children too violent to function in a family setting. I can't stop crying but my wife hasn't been this happy in years. She was actually smiling as our daughter was restrained and forced out the front door.",
"Today, three days after finally having a bed to sleep on, I woke up with multiple bedbug bites. I can't use my blankets, wear any of my clothes and it's back to sleeping on the floor for me.",
"Today, my mother has stooped to a new level of \"hiding\" Christmas gifts. She now just dumps them in the middle of the floor and says, \"Don't look at them.\" If she even thinks I'm glancing in the direction of the pile, she will burst into a manic rage, and yell at me for \"ruining the surprise.\"",
"Today, my boyfriend and I were finally alone and things were starting to get intimate. I was on top of him trying to be sexy, when in my excitement I giggled and called him a \"silly girl\" by accident.",
"Today, I went on my first official date I've been on since my divorce. Things were going great until he ordered his fourth 32oz beer; he got hammered and became a horny octopus. Oh, and he farted whiled trying to give me a goodnight kiss.",
"Today, my boyfriend of six months said he wanted to take our relationship one step further. I thought he was going to ask me to move in. He meant he wanted to fart in front of me.",
" Today, a customer asked me if I was English, because I was struggling to understand what he saying. I said yes. He then called me a liar, and said I must be \"one of them Polish immigrants.\" Oh, and he also had a thick Scottish accent.",
"Today, I received a call from a company attempting to steal me away. Flattered, I told them I liked my job and the answer was no. When I told my boss, he said they're thinking about laying me off and I should've taken the job.",
"Today, my little girl spoke her first word. It was ''Daddy''. Daddy left before she was born and she has never met him before.",
"Today, I received a ticket for not having my headlights on. The cop who pulled me over had a broken headlight.",
"Today, I was picking my daughter up at day care. She was outside playing kick ball. A red ball rolls over to me, and trying to impress the kids, I kicked it over the slide. I turn around to see three crying six year olds. It was their hamster ball.",
"Today, while driving home, I was so lonely I turned on my GPS, even though I knew the way, so it would feel like I had someone to talk to. It made me feel better.",
"Today, at work, I decided to make things more interesting, so when I called people I used a fake accent. As I was using an Australian accent, the person I was talking to asked me where in Australia I was from. I desperately replied, \"Where the kangaroos are...\" I'm now jobless.",
"Today, my family and I went to the coast. Our dog was off the leash because we were the only people around. He was delighted to find a dead seal carcass and roll around in its remains. We then had a 3 hour drive home.",
"Today, after house sitting for my neighbor, I realized that he has a camera pointed at my pool.",
"Today, after my work's Christmas party, everyone got so drunk that I had to help one of my only sober co-workers take everyone home and clean up vomit.",
"Today, I was walking around my college campus when someone asked me if I had gotten separated from my tour group. He didn't believe me when I said I was a student there. This happens all the time.",
"Today, the mall I work at started playing Christmas songs on repeat. It's the beginning of November.",
" Today, my now ex-boyfriend was kind enough to let me live on the couch because I have nowhere to go. I have to see the homewrecker he cheated on me with...",
"Today, I locked my keys in the car while the car was running because I got out to get the parking ticket attached to my windshield.",
"Today, I went downtown to pay my speeding ticket. After standing in line and arguing with a rude woman behind the desk, I get back to my car only to find an expired meter and a parking ticket. I got a ticket while paying my ticket.",
"Today, after supporting QLD in the State of Origin for the last 20 years of my life, I found out that I was actually born in NSW.",
"Today, after resigning from my current job, I was let go from the new job I hadn't even started yet.",
"Today, while working as a cashier at a fast food restaurant, a customer asked me how many chicken nuggets were in our 6 count chicken nuggets.",
" Today, as I listened to the guy I've been seeing pour his heart out to me, all I could think about was how much I needed to poop.",
"Today, my husband tried to use his \"grief\" over his grandmother's death to manipulate me into giving him a blowjob. In the toilets. During the funeral. With his family only a few yards down the hall crying their eyes out. What an asshole I married. An absolute asshole.",
"Today, I set up a hidden camera in my room so I could prove that my sister beats me up when my parents aren't home, since they always accuse me of lying about it. When I showed them, they wasted no time accusing me of \"provoking\" her off-camera.",
"InkedToday, I came to terms with the fact that my dad will die without knowing I have tattoos on my body. I'm afraid my dad will suffer a deadly heart attack due to the revelation, as he had two heart failures in the past. My dad is still the sort of person who thinks that people with tattoos are criminals.",
"Today, I drove home from work, only to find both my next-door neighbours loudly arguing in the middle of my driveway. I got out and asked them what the hell was going on, only to find out one of their inbred kids had put a brick through my back window, and each is claiming the other did it.",
"Today, I called a locksmith to unlock my car. He got it unlocked, but broke the handle so the door wouldn’t open. We had to break a window to get in. He still charged me his usual fee.",
"Today, I almost died. How? I nearly suffocated after passing out while chewing an entire pack of gum. I should really drink less.",
"Today, someone shat liquid poo in the hallway at work. Right. Outside. The bathroom. Another foot and they could have used a toilet instead of the carpeted floor.",
"Panic mode: activatedToday, I got out of bed and saw muddy footprints next to it. They were at least three sizes bigger than mine. I live alone.",
"Today, I was fired. My boss told me via email that it was because I \"don't have enough experience with fun spiritual.\" Uh, what?",
"Today, I complimented my mom with \"Hey, I think you lost some weight.\" She replied with \"Yeah, I think you found it.\"",
"Today, at 4:00 a.m., I woke up and realized that I had thrown an expensive gift certificate for a friend in the garbage. Since it was garbage day, I ran out in the rain in my pajamas and rifled through all three bags of garbage. Twice. I found the gift certificate. It was in my pocket.",
"Today, I was a host during kids' event. I did my job and started to do some funny moves to entertain the kids. I was wearing a top with a really low cut. Then noticed that all the children were pointing at me happily and adults looked surprised. Then I noticed that both my boobs had popped out.",
"Today, I had a date in my dreams. It was a pity date, with someone who is already taken. I can't even get a real date in my dreams.",
"Today, my girlfriend broke up with me because \"our priorities aren't the same.\" Her priorities turned out to be getting into my coworker's pants.",
" Today, I was having sex for the first time with a girl who wanted to be friends with benefits. Halfway through sex she noticed that I had the same tattoo as her brother, and had a full-on panic attack that lasted half-an-hour.",
"Today, I packed my bags and left for the airport. When I passed through security, the X-ray scanner discovered that my cat had also come along for the ride.",
"Today, my boyfriend told me that he wanted to break up with me but it had to be after our cruise together because he doesn't want to lose out on money. Can't wait for the Bahamas.",
"Today, I got pulled over for drunk driving. This is the second time its happened. I was completely sober both times.",
"Thanks but no thanks.Today, my son surprised me by waking me up to be first to greet me a happy birthday. He was with his marching band buddies in full battle gear, playing the chorus of Stars and Stripes Forever. In my bedroom. At 5am.",
"Today, I went to visit my sister, who lives four hours away from me. I'd only just sat down on their couch when her husband told me I needed to leave so they could have sex.",
"Bass, how low can you go?Today, I tried to study for my upcoming engineering exam. The class I’m in is notorious for being incredibly difficult and is oftentimes the reason for people dropping out of the major. Too bad the dudes in the apartment next to me have a subwoofer and keep playing music that has way too much bass.",
"Almost thereToday, I got a better job offer out of the blue, more pay, less work. I informally accepted and handed my notice as legally required. They rescinded the job offer. I'm now unemployed at the end of hiring season.",
"I'm right hereToday, after applying for a promotion to a position which I've been working my ass off for two years to get, my managers thought it would be appropriate to discuss other applicants in front of me, even asking me to compare my resume with theirs to see the \"caliber\" of what I'm up against.",
"Today, my boyfriend decided to visit me at work. With another girl.",
"Today, I went to the dentist to have two cavities filled. I hate the dentist. After he'd started drilling, I heard a \"clunk\" noise followed by an \"Oops.\" My dentist had cut my tooth in half. Now I have to go to surgery to have the tooth extracted.",
"Today, I helped my parents move out of their old house. While I was guiding my dad down the stairs with the couch, my mom asked me to pick up the tape on the step below me. I bent over and grunted. My dad thought I said \"Go\" and kept moving. He knocked me down two flights of steps.",
"Today, I made roast beef with mashed potatoes and green beans for dinner. My 8-year-old daughter was crying and gagging the whole time, and eventually said between sobs, \"Can't you just beat me and send me to bed hungry instead?\" I have no clue where she got that idea from.",
"Downsizing awaitsToday, I got a 25-cent raise at work. That would be wonderful, had they not cut 6 hours off my schedule as well. I'm now making $200 less a month than I was pre-raise.",
" Today, frustrated that my boyfriend never gives me any orgasms when we make love, I tried politely hinting that he needs to improve. To start with, I said maybe he should be more spontaneous in bed. He replied, \"What, like putting it in your ass? Gotcha.\" Great.",
"Today, I stubbed the same toe three times in fifteen minutes. How? My sister moved most of the furniture in the house to the left by a few inches, because she thought it would be funny to watch me get confused and suffer.",
" Today, I'm a 34 year old male who just got given the sex talk on my Facebook timeline by my senile mother. 5ML ",
"Today, I was taking a biology final and was just randomly tapping my pencil. My teacher thought I was somehow communicating with the person next to me, and decided to fail me.",
"Today, I found out that I was moving to Germany. I'm going to be put back a year in school because of the system change. I also don't speak a word of German. Why? Because my mother wants to brag about this experience to her friends.",
" Today, I was having sex with a guy I met at my friend's party. He stopped mid-thrust, climbed off, and started talking about how nervous he is about buying his first car next week.",
"Today, after supporting QLD in the State of Origin for the last 20 years of my life, I found out that I was actually born in NSW.",
"Today, a drunken customer blindsided me after I told him I would not be giving him a free drink after I watched him put his own hair in it.",
"Today, I pulled a muscle in my arm while wiping my butt.",
" Today, I met my girlfriend's very religious parents for dinner. Somehow we got to talking about her groin hernias that were repaired as a baby. I never knew she had hernias repaired and said, \"But she doesn't have any scars down there.\" There was a long awkward silence.",
"Today, I was working as a clown (Pennywise) in a haunted maze. A bunch of drunk guys came in and started breaking props. I decided to stay still and follow through with the scare. I ended up getting kicked in a very sensitive area. The security guard just laughed.",
"Today, I thought my family would like it if I celebrated the new year with them. My brother thought that I'd like him to shoot my butt with his new gun in celebration.",
"Today, I got a rejection letter after I filed a claim regarding potholes on a high speed road that damaged my vehicle. Two of my tires and very expensive Honda mags, worth 1000$ each, are done for. Meanwhile, the city claims they're working hard to fix the roads. It's been 3 weeks, the potholes are still there and the city says they're not at fault.",
"Today, I was taking a dump, when my dad shouted for me to go wash the dishes. Fed up with his constant shit, I told him to bite me. He took this as an invitation to wedge the bathroom door shut for nearly two hours, despite all my pleas and apologies.",
"Today, I rented a copy How To Train Your Dragon for my young son to watch. I put the DVD in, hit play without paying attention, and went off to make lunch. A few minutes later, my son ran into the kitchen screaming. Apparently, there was a mix up at the rental store and I got a copy of Saw IV.",
"Today, it was my second day at my new job as a bank teller. I got locked in the vault while alarms were being tested. I was in there for an hour and none of my coworkers had even noticed that I'd gone missing. Gee, thanks.",
"Today, at work, I watched a man throw up in his hands, dump the contents on his plate, then eat the things it \"didn't touch\". I had to wash his plate.",
"Today, I was on the city bus, and there was a woman and her child sitting behind me. I began to feel tugging on my jacket so I leaned forward, assuming the child was pulling at my jacket. I sat back and felt the tugging again. After a couple of minutes, I heard the mother say \"stop chewing on that!\"",
"Today, my boyfriend broke up with me via text message. Every 20 minutes or so, I'll get a notification that I have a new message, and I check it just to find that same message sitting there. I'm being trolled by my own phone.",
"Today, I was performing CPR on a woman on her floor while her internal defibrillator kept firing, making her whole body jump. When it fired, her hand went straight up into my nuts.",
"Today, my 4 year old cousin is staying overnight. Every time I fall asleep he wakes me up to tell me I fell asleep.",
" Today, my now ex-boyfriend was kind enough to let me live on the couch because I have nowhere to go. I have to see the homewrecker he cheated on me with...",
"Today, 2 hours before a 13-hour flight, I found out I had head lice. I'm a 24-year-old woman.",
"Today, on more than one occasion, I was mistaken for my boyfriend's mother, by his own family.",
"Today, I told my boyfriend about my foot phobia. To help me \"get over it\", he took his socks off, pinned me down, and rubbed his foot against my face until I started sobbing.",
"Today, I was called in to work on my day off to cover for a co-worker because she was busy getting it on with my brother.",
"Today, after getting my car completely fixed after it being damaged for a year, I was driving and the entire side panel on the car fell off. The repair man forgot to put the screws back in.",
"Leave us aloneToday, a customer asked me if I was my husband's sister. A little flabbergasted, I replied, \"No, I'm his wife.\" He went on to say, \"Ah! But surely, you're related? Cousins?\"",
"Today, we found out where our daughter had been hiding her crayons. We also found out why our stereo stopped working.",
"Today, my boyfriend and I got robbed. He was so depressed about all the stuff we lost, I decided to cheer him up with a lap dance. I told him to sit on a chair. We have no furniture left. He started crying.",
"Today, after several long years, a lot of debt, and two great degrees from a top university, I had to move back in with my parents, because no matter where I look, I can't find a job.",
"Today, my boyfriend couldn't go on a date with me because his mom said no. He's 23.",
"Today, I was in a public restroom with my 4 year old daughter. I took her in the stall with me, and as I was using the restroom she looked down and loudly asked, \"Mommy! Why do you have a beard on your peepee?!!\" Then I heard everybody in the stalls next to us laughing.",
"Today, I got marinara sauce on my new white shirt. I went in my desk for my Tide-To-Go pen and started using it on the spot. Turns out orange highlighters look a lot like Tide-To-Go pens when you don't look closely enough.",
"Today, talking to my boyfriend about each others families, we noticed we both had an aunt with the same name. After a while of trying to figure things out, we decide to call her. Turns out that we are long distance cousins.",
"Winner winner chicken dinnerToday, I realized I have finally turned into my mother when I got excited about using so many coupons that I only paid 70 cents for $14 worth of groceries. I need a life.",
"Today, I had to use a public bathroom. I'm pregnant, though I don't really suffer from morning sickness. I do however suffer from sympathy puking, which kicked in with horrifying consequences when someone burst in and started vomiting in one of the other stalls.",
"Today, my girlfriend found out that I secretly watch porn while she sleeps, but she seemed to be fine with it. That's until the next day, when she got on my Facebook account and publicly shared every porn page I visit. My father even commented, \"Poor choice in porn, son\".",
"PrioritiesToday, I called my dad to ask why my university tuition had not been paid. He said that \"my school was too expensive and he couldn't afford it.\" He then asked me if I would take in his mail while he was away. He was taking his new wife to Hawaii, apparently it's beautiful this time of year.",
"Make your mind upToday, while taking to-go orders at my restaurant, a customer called saying he wanted his food well done. He even said, “Burn it to a crisp.” Which is what I told the kitchen. When he came to pick it up, he opened his food, inspected it and screamed, “Not this burned, you damn retard!” and threw it at me.",
"Today, the couple downstairs decided they wanted to try a home birth.",
"Today, I went to a New Year's party with my boyfriend. Later into the night, he got drunk, and left me there to go to another party with his friends. I have no car, and no way to get home.",
" Today, my father-in-law decided to \"fix\" our bathtub and ended up flooding the bathroom. Later, in his attempt to clean things up, he walked, without permission,...",
" Today, I made my friends and family laugh by trying to put on costume glasses with a giant super-sized nose attached to them. They laughed hysterically. Not because of the gigantic nose, but because my real nose was radically bigger and the fake one wouldn't fit over it.",
"Today, I tried to kill a spider by throwing a shoe at it. All it did was slice the spider's egg sac open, releasing all its babies.",
"Today, while working in a dark nightclub, I dropped a red charger. Retracing my steps, I found it, or so I thought until I picked up a used tampon.",
"They'll hear you comingToday, I was diagnosed with exercise-induced asthma. I wanted to be a cop.",
" Today, my boyfriend whipped out his proverbial notebook, where he obviously keeps notes of what I do and how I act during sex, and then grilled me about every single one of those things. Now I'm scared to do anything because I don't want to be interrogated about it later.",
"Today, just like every morning this month, I woke up, put on my clothes, looked out my window, and was pointed at by a man in a ninja outfit on my neighbor's roof. The police still can't find him.",
"Today I opened the door for my cat and he brought in a rat with him. Now the rat is hiding in my house.",
"Today, my dad and I ran into a guy I've been dating. He flipped out and accused me of cheating on him. This is now the second guy to have a similar reaction to my dad. I guess this is one of those unexpected consequences of teen pregnancy that my parents didn't see coming.",
"Today, I went to see my dermatologist friend for a free consultation on my terrible acne. During my visit, she said I probably won't be getting any more pimples. Excited, I asked her how she could tell. She replied, \"There's no more room for it.\"",
"Today, we are once again in full COVID lockdown. I live in a tiny apartment, I'm pregnant and the only thing that helps me sleep is walking for an hour...",
"Today, my 3-year-old son decided to pull down his pants and pee outside as our local city's parade had just started marching down the street.",
"Today, I gave a speech at a charity event in part to help with my shyness. Nobody told me I was standing on top of an air vent. It went on. My skirt flew up, revealing my underwear to 90 people. Nobody remembers the content of my speech.",
"Today, I was glued to the toilet all day, gushing fountains of crap, due to my own bad cooking. It got so bad that I ran out of toilet paper and had to desperately jump in the shower and stay there for nearly two hours. I can't even feel my own asshole any more.",
"Today, I got stuck on an airplane for a while before takeoff. Someone decided it was a great time to get diarrhea while on the toilet, and we couldn't take off for safety reasons.",
"Today, I woke up with a rash all across my body. Last night, my boyfriend and I got it on in some bushes, and it seems one of those was poison ivy.",
"Today, I told my mom I wanted to try out for the track team. Her exact words were \"good luck, fatty\".",
"Today, my husband's mistress purposely and dangerously induced her own labor so that she would have the baby on my birthday. Yes, I'm divorcing him.",
" Today, my now ex-boyfriend was kind enough to let me live on the couch because I have nowhere to go. I have to see the homewrecker he cheated on me with...",
"Today, I get home and there's a package waiting for me. I ordered something online 2 weeks ago for a girl I like. She's not available anymore. No refunds.",
"Today, I was showing my crush/co-worker how to operate a particular piece of machinery. She exclaimed out loud, \"Oh! This knob pulls out,\" then mumbled under her breath, \"unlike my boyfriend.\"",
"Today, I learned that not only is my husband having an affair with my own mother, but my whole family knew. They were keeping it a secret from me for 3 months.",
"Today, I came home from work to my basement flooding. With sewage. That wasn't from our house.",
"Today, I realized how lonely I am when I got excited over receiving my daily weather update from the Weather Channel.",
" Today, while getting it on with my wife, I started to talk dirty to her. She started laughing. When I asked her if she wanted me to stop, she just kept on laughing.",
"StuckToday, my brother thought it’d be a hilarious prank to put Super Glue in my hair extension glue. I didn’t notice until after the first couple rows.",
"Today, I told my boyfriend that I've missed my period, and that I think I might be pregnant. He started panicking and ended up puking in the toilet.",
"Today, my friend decided to come clean to his parents about his pot usage. He told them that he did it with me on many occasions. His parents decided it would be the right thing to call my parents. Thanks a lot asshole.",
"Today, I found out why I had been waking up feeling like crap for the past week. I found tufts of cat fur in my pillow case, and I am allergic to cats. My little brother thought I would get so sick, and he could have my XBox.",
" Today, my now ex-boyfriend was kind enough to let me live on the couch because I have nowhere to go. I have to see the homewrecker he cheated on me with...",
"Today, my daughter asked me if we could adopt a child. I said no, since we can't afford to support another child. She then asked me if she could just adopt another dad instead.",
"Today, while I was trying to explain to my friend how smoking weed everyday doesn't make you stupid, I forgot what I was talking about mid-sentence.",
"College life is hellToday, my crush came up to me at a college party and said \"I like you.\" I tried to be cool and said sarcastically, \"Thank you. I like myself too. That was a wonderful prank.\" He was amazed, and asked me how I knew it was a prank.",
"Today, our school started an anti-bullying policy, and we watched a video about bullying. After the video, I told a teacher about a bullying case going on that I know about. His response? \"Tell someone who cares\" as he walked away chuckling.",
"Are you a wizard?Today, I tried to prove a point to my six-year-old son who refuses to drink water from the kitchen sink in favor of from the bathroom faucet. I filled up two cups, one with the kitchen water and another with the bathroom water, thinking he wouldn’t tell the difference. He gagged on the kitchen water.",
" Today, my girlfriend said she didn't want to have sex because it takes too long.",
"Today, I bit into a Reese's Cup that had been sitting on my desk for a while. As I did, half of a yellow meal worm fell out and landed in front of me, the other half was in my mouth. It was wiggling.",
"Today, we had our busiest day at work all year with lots of angry people calling, and a co-worker called in sick. I went to my local game shop after work, exhausted and upset, and guess who was at his usual table running a Dungeons and Dragons group, apparently not too sick to go out. Yeah.",
"Today, while on the train to university, I realized it was my stop and quickly stood up to get off. Or I would have, if my leg hadn't gone to sleep and caused me to fall, landing face first into the crotch of the old guy in front of me.",
"Today, my boyfriend broke up with me by picture, during a game of Draw Something.",
"Today, we are once again in full COVID lockdown. I live in a tiny apartment, I'm pregnant and the only thing that helps me sleep is walking for an hour...",
"Today, during my family's traditional 4th of July weekend celebration, my water broke. I kept trying to tell them and asked them to take me to the hospital, but they couldn't hear me over the fireworks. They all just kept smiling and nodding.",
"Today, I was putting a wristband on a little boy's wrist so he could swim in the waterpark. Just before I finished, he coughed all over my hands and arms. I finished and looked up at the boy just in time for us to make eye contact and for him to cough directly into my face.",
"Today, we are once again in full COVID lockdown. I live in a tiny apartment, I'm pregnant and the only thing that helps me sleep is walking for an hour...",
"Today, I found out the room I've been sleeping in has black fungus growing on the wall behind the bed. So, that's why I cough until it feels like my lungs are coming out in the morning. Mystery solved.",
"Today, my step mom and her kids moved in. This is my first night sharing a room with her daughter. She snores, sleep talks, and sleep scratches the side of the bed creating a sound like nails on a chalkboard.",
"What he is thinking?Today, I was on a long road trip and I really had to pee. With no rest stop for miles and night having fallen, I decided to pull over on the side of the highway and pee in a fast food cup. A cop knocked on the window to see if everything was okay, while I was mid-squat.",
"Today, my drunk boyfriend decided to try to serenade me by throwing rocks at my window and singing a song about how much he loves me. This would have been extremely sweet if he would have gotten my window instead of my dad's.",
"No RagretsToday, my wife made me sleep on the couch because I ate the last Magnum Ice Cream bar. Last week, she bitched me out for singing too loud in the shower. I strongly regret leaving my ex-girlfriend of 5 years for this woman.",
" Today, my boyfriend and I were at his house having sex. After about 30 minutes, his mom came home and was knocking on the door asking \"What are you doing?\" Thinking I might have a chance to sneak out, I got dressed real quiet. Then my boyfriend answers, \"Zoe. I'm doing Zoe.\"",
" Today, I found out that I take long enough showers for my boyfriend to sleep with my sister and put everything back to normal before I get out. I found out when I needed more shampoo that was in a shopping bag in my room.",
"Today, my Canadian friend is staying a few days at my parents' house. I drove him from the airport, only to find my idiot dad had decked the spare room out with maple syrup bottles. He keeps saying \"eh\" all the time and asked \"What's he so upset aboot?\" when my friend was offended.",
" Today, my boyfriend and I were making love. I was really close to climaxing, when he suddenly stopped, smirked, and said, \"Hang on, I'm buffering.\"",
"Today, I walked into my bedroom and realized I really needed to clean it. As I started to pick everything up off of the floor, I tripped over a shoe, slipped on a water bottle, pulled down my shoe rack and landed in my armoire. My room is now dirtier than it was when I started.",
"HyperviolenceToday, I was at a restaurant waiting for a table. Some lady walked by, smelling like BO and patchouli oil. I attempted to cover my nose with my sweatshirt, but I thumped a small girl in the process.",
"Today, the satellite radio at work went on the fritz, playing one song over and over. Management wouldn't turn it off, though, because then customers would miss out on all those upcoming-sale announcements that run intermittently. Meanwhile, I got to listen to \"Footloose\" for eight hours.",
"Wait for me!Today, the parking shuttle for work pulled away right as I was walking up to it. I was late to work. For the second day in a row.",
"Today, it hit me that I'm incredibly pathetic, when at the age of 21, I tucked my stuffed animals into bed with me, facing in different directions so they could keep watch for monsters while I slept.",
"Today, while packing up my classroom, I had a sudden stinging pain in my finger. Since I live in Arizona, my first thought was a black widow or scorpion, but the ER doctor didn't believe me and said it's nothing. Tell that to my tingling swollen arm. It’s been 4 hours.",
" Today, I asked my fiancé what he liked most about being in a relationship with me. His answer? \"I can watch your boobs without being called a perv.\"",
"Today, I came back from break to find that my roommate had been shitting in the bathtub for the entire 2 weeks I had been gone.",
"Today, my professor tried to scare the hiccups out of me. Some pee came out instead.",
"Today, while meeting some of the big boss guys at my new job, one of the men sneezed on his hand and then grabbed mine for a handshake. I felt every gooey bit of his snot between our hands.",
"Today, one my friends died. All my crying gave me a headache, so I asked my boyfriend to bring me some aspirin. My headache didn't go away. Instead, I got diarrhea because my boyfriend gave me laxatives instead of aspirin as a \"joke\" to cheer me up.",
"Today, through a mutual friend, I met the girl of my dreams. After flirting and exchanging numbers with her, my friend confessed that she's liked me since the day we met. Now the girl of my dreams doesn't want to pursue a relationship with me out of respect for our friend.",
"Today, after supporting QLD in the State of Origin for the last 20 years of my life, I found out that I was actually born in NSW.",
"Today, I bit into a barbecue-ed corn cob, forgetting I had a filling on my chipped front tooth. I re-chipped it.",
"Today, my brother put a mac-n-cheese cup in the microwave without any water. My entire house smells like burnt cardboard.",
"Today, I rear-ended a car. While we were waiting for the police, we made small talk, at which time I learned he was an attorney.",
"Today, I received an envelope with my name written in beautiful writing in my mailbox. I just moved in the day before and hadn't given the address to anyone or met my neighbors yet so I was a bit surprised by it, even more surprised to find nothing but a dick pic inside.",
"Pay upToday, my grandfather sent me a bill from when I had to live with him in foster care. I apparently owe him 62k for shampoo, food, etc.",
"Today, the man who has been my stepfather for six years, has forgotten how old I am. However, he remembers exactly how much my real father owes him for child support.",
"Today, I wore a sleeveless shirt for the first time in years, when I glimpsed something on my shoulder that looked like a spider. I let out a scream that sounded like a donkey having a stroke and flailed my arms. Then I realized it was my tattoo, and that I was freaking out everyone on the bus.",
"BlabbermouthToday, after a lifetime of my mom being a huge gossip, even about her own kids, and lying about being the one spreading it around, my siblings and I have decided to stop telling my mom things. Now she lays these huge guilt trips on us, just because we don’t want the world to know our business.",
"Today, I had to drive all the way across town to clean my grandfather's toilet for him.",
" Today, I was buying condoms for my girlfriend and myself. While at the checkout counter, my guy friend sees me, runs to me, puts his arm around me, kisses me on the cheek, then yells \"Thank you baby!\" There were about twenty people behind me, they all gave me dirty looks.",
"Today, I went to my fifth job interview in a month. While going over my CV, I found a watermark on the bottom of my cover letter that said it was generated by a template website. Yep, I gave all previous interviewers the same cover letter, with the same watermark. Can't wait to hear back!",
"This Charming ManToday, I explained to my man child of a boyfriend that we don't reuse dirty dishes. We have to wash them. He doesn't think it's gross and yelled at me, throwing the pan in the sink. Oh, he also refuses to wash dishes.",
" Today, my father-in-law decided to \"fix\" our bathtub and ended up flooding the bathroom. Later, in his attempt to clean things up, he walked, without permission,...",
"Today, I was helping my church clean up a park. I was given a sledgehammer and told to break up a concrete picnic table so we could haul it off. About half way through I swung the sledgehammer REALLY hard, completely missed the table, and hit myself in the shin.",
" Today, my now ex-boyfriend was kind enough to let me live on the couch because I have nowhere to go. I have to see the homewrecker he cheated on me with...",
"Today, I was walking home from the store when I saw my uncle. I went over and gave him a surprise hug. He grabbed my ass. He wasn't really my uncle.",
"Today, working my job, I had to explain to a kid that Pokemon is owned by Nintendo and they don't make it for the Xbox. Upset by this, he took hold of my leg and started biting. I'm also suspended, because his mother complained when I kicked him off me.",
"Today, for my birthday, my brother gave me some of those fake 'Harry Potter' edible cockroaches. I ate one. It wasn't fake.",
"Start worryingToday, I discovered that my boyfriend doesn’t have me as a pinned text message thread on his phone. But he definitely has his female best friend pinned. He even has a cute nickname for her. The girl he says, \"Not to worry about.\"",
"Today, my mother-in-law moved into my wife's two-bedroom apartment. She's quite possibly the reincarnation of Hitler himself, and she'll be staying until this time next year.",
"Today, I was joking around with my eight-year-old son. I told him to pull my finger. I farted, then laughed. He decided to try it on his mother. When she pulled his finger, he crapped his pants. He told her I taught him how to do it.",
"Today, I wrote a fake phone number on my neck to make it look like someone had hit on me.",
" Today, my father-in-law decided to \"fix\" our bathtub and ended up flooding the bathroom. Later, in his attempt to clean things up, he walked, without permission,...",
"Today, my daughter had ice cream while I was napping. She didn't want me to know so she put the bowl in the trashcan and put the spoon in the garbage disposal and turned it on, because she thought it would make the spoon disappear.",
"Today, I was finally starting to relax after a stressful and expensive move, where I had to give up half my belongings and furniture, as well as my cat. All the stress came rushing back as my new landlord told me that he's selling the building and I've got 30 days to vacate.",
"Today, marks my fifth day being an English teacher's assistant. I spent it like the other four days: grading and editing terrible Teen Wolf, One Direction and Doctor Who high school fan-fiction. Six months until I get out of here.",
"Thanks, but no thanksToday, I got fired from the community service I was doing out of kindness.",
"Best uncleToday, I realized that the last 3 months, I've been taking care of my girlfriends 1 year old kid. The other night, she told me that I was a good uncle to him.",
"Today, I was eating ice cream and struggling to chew a particularly hard chunk of chocolate. After finally breaking it into pieces, I spat it out because it tasted terrible. Then I discovered that I was missing my temporary crown. Now I have no upper molar.",
"Alexa, play \"I'm Not In Love\" by 10CCToday, I went on a date I was really enjoying. My ex-boyfriend called halfway through. When I answered, he told me he wanted to get back together and couldn’t stop thinking about me. I didn’t realize my phone was on speaker. My date heard everything.",
"Today, I received an unexpected package from my mother. It contained my cat's ashes. Apparently he died 3 weeks ago and she thought this was the best way to tell me.",
"Today, I found out that the noise I thought was a mouse in my room was a water bottle shaking when my refrigerator turned on. I stayed up till 4am looking for a mouse that didn't exist.",
"Today, I was mistaken for my twin brother twice. This probably wouldn't be so bad if I wasn't a girl.",
"Today, I met my boyfriends mother for the first time and hoped to make a good first impression. When I tried to say 'Hello', a loud rippling burp comes up from my throat. And not only that. A small chunk of mucus flies out and lands on the floor between us. So much for a good first impression.",
"Today, I went commando for the first time at school. It went really well until gym class, when I got distracted and changed like I normally do. I didn’t realize my mistake until my friends started laughing. I accidentally stripped in front of my whole class.",
"Today, I was at ATandT getting my phone fixed. At one point, the salesman said 'you should see this'. It was a text message from some girl apologizing for sleeping with my boyfriend for the past four months, and telling me that they were moving him out of our apartment.",
"Today, my girlfriend broke up with me through a text message. In retaliation, I started typing a long list of everything I hate about her. Just as I pressed the send button, she text me again saying \"Just joking. You know I'd never leave you. Love you babe :)\"",
"Today, when I finished helping a customer, she said, “Thanks cutie!” When I thanked her she giggled and said, “I just like making people smile, plus I bet you don’t get called that often!”",
" Today, I heard my roommate moaning my name in the shower.",
"Today, my dad called for the first time in six months. He needs someone to bail him out of jail.",
"Today, I had to sit through the wedding of my best friend and the love of my life, and pretend to be happy for them.",
"Today, my mom publicly pole danced. In a playground.",
"Today, at 2 am on a Saturday, I purposely updated my Facebook status from my iPod so people will see that I posted from a 'mobile device' and think I'm out at a bar having a life, instead of sitting at home on my bed watching movies on my Netflix.",
"CompassionToday, my mum screamed that there is nothing wrong with me, after I literally coughed up blood in front of her. This all started over me getting my medications delivered to our house, as I’m not allowed out due to Covid-19 as I’m high risk.",
"Today, I finished the first month of a diet and exercise program designed to help me lose weight. To keep myself motivated, I have avoided the scale the entire time. I weighed myself today. I've gained 6 pounds.",
"Today, I finally got the guts to ask out my crush. She said yes and I was really happy. Then I woke up.",
"Fucking Stevie TToday, I was happy to take a break and do a guitar performance, but my teacher was the rudest ever. He had his guitar at the front row, playing while I was, and he played the song live with me just to confuse me, and ending up ruining the performance.",
"Today, I had to run a timed mile. I'm terrible at running. During the run, I thought I was doing a good job. That is, until the teacher told me to stop because I was three laps behind everyone else.",
"Today, as I was walking back inside I noticed my mop leaning on the wall next to my door. I picked it up and started slow dancing with it, imagining it was the girl I'm in love with. I didn't notice my neighbours bunched up at their window laughing.",
"Today, while I was showering, my brother thought it would be funny to burst through the door pretending he was a burglar. Panicked, I went to grab the soap bar as a weapon, slipped, fell and hit my head on the faucet.",
"Today, we watched a movie in class. Afterwards, the professor asked us what we thought. I raised my hand and said it was pretentious, dull and a really poor example of filmmaking. It was the movie HE spent five years writing and directing.",
" Today, I found out that my boyfriend's \"therapy\" meetings have been with my best friend, in his truck.",
"Today, my dad suggested that as an alternative to buying me new school clothes that actually fit, I should just join the swim team, lose some weight, and wear my stuff from last year.",
" Today, I thought I had carbon monoxide poisoning because I had the symptoms and my detector was going off. I called the fire dept, they checked me, they checked my apartment. My apartment is fine; I'm just out of shape, have high blood pressure, and don't know how to work simple electronics.",
"Today, after I caught my husband cheating and lying, he had the nerve to claim it wasn't a big deal because, \"I always come home to you!\"",
"Today, after supporting QLD in the State of Origin for the last 20 years of my life, I found out that I was actually born in NSW.",
"Today, my boss told me they were letting me go because they \"could no longer afford to pay me.\" Never mind the catered lunch they had the day before, which cost more than a week's worth of my salary.",
" Today, my now ex-boyfriend was kind enough to let me live on the couch because I have nowhere to go. I have to see the homewrecker he cheated on me with...",
"Today, I dreamed I was getting married. I was wearing a white dress, had incredible cleavage and perfectly done makeup. Just one problem. I'm a guy.",
" Today, my now ex-boyfriend was kind enough to let me live on the couch because I have nowhere to go. I have to see the homewrecker he cheated on me with...",
"Today, my mother tried to have a conversation with me. While she was taking a piss. With the bathroom door wide open.",
"Today, for Easter, my brother and sister both got $200 gifts from my parents. I got a chocolate egg. I'm allergic to chocolate.",
"Today, my downstairs neighbor died. I knew because the smell wafted up to my apartment.",
"Today, we are once again in full COVID lockdown. I live in a tiny apartment, I'm pregnant and the only thing that helps me sleep is walking for an hour...",
" Today, I found out that my sex face is definitely amusing after the third girl in a row started laughing at it.",
"Today, my teacher took my test along with another student's and gave us both a zero. Why? Because we both have colds so when we breathe through our nose it makes a sniffle noise. She thought we were using a secret code to communicate by sniffling.",
"Today, I got a cute girl's number for the first time. Too bad it was because she rear ended my car.",
"Today, my girlfriend broke up with me because I was, \"trying to change her.\" A week ago I asked her to stop talking to the 6 guys that have all previously asked her for nudes.",
" Today, my friend asked me to fix his laptop for him because it is loaded with viruses. When I turned it on and started searching for the problem, I couldn't find it. Luckily I was able to find a video of him banging my girlfriend. We've been together for eight years.",
"Today, after supporting QLD in the State of Origin for the last 20 years of my life, I found out that I was actually born in NSW.",
"Freaky.Today, according to my mother, who is only 19 years older than me and raised me by herself, I was conceived in a satanic ritual to honour the Horned God and have at least 4 potential fathers. She was too stoned to remember the actual number or their names.",
"Today, my house was the only house left that still had its Christmas lights up, so I decided to take them down. Almost done, my fingers brushed over a spiderweb. Startled, I jumped off the ladder and broke my shoulder. Oh, and the spider still managed to stay on my hand, giving me a panic attack.",
"Today, I found out why the temps were not invited to the company Christmas party. The company paid for the regular employees to go to a nice restaurant, gave them nice presents, and handed out substantial bonuses. They keep telling me they can't hire me on because the company can't afford it.",
"News to meToday, my dad told me he liked men. While he was making a drunken speech. At my wedding.",
"Today, there was a guy following me, so to avoid him, I crouched down and basically waddled behind a wall to get past him. Sure enough, first thing I see when I get around the corner, while still waddling, was an unhappy midget couple staring right at me.",
"Today, a week after my son was born via C-section, I received 3 messages from 3 different women saying that they had recently slept with my fiancé. One of them said they tested positive for herpes.",
"Today, after being jobless for 2 years, I got a call back for an interview. I was ecstatic until I saw the date. It's the same day I leave for a weeklong, nonrefundable vacation. I applied for the job 6 weeks ago, and since not hearing anything bought the vacation 2 weeks ago.",
"Today, after supporting QLD in the State of Origin for the last 20 years of my life, I found out that I was actually born in NSW.",
"Today, my mom turned to me and said, \"You know, you're the kind of person that has to change literally everything about themselves to get a guy to like you.\" I thought she was joking so I laughed. She then said \"Like that. Your laugh... What is that? Change that.\"",
" Today, my now ex-boyfriend was kind enough to let me live on the couch because I have nowhere to go. I have to see the homewrecker he cheated on me with...",
"Today, whilst working as a language assistant in Germany as part of my degree, some 9 year-old German kids asked me to please speak English to them because my German was so poor.",
"So sorry I called you a dingdongToday, I sent a draft email to my boss. The receptionist, thinking they were being helpful, forwarded it straight to the client. It's not ready for the client. I mean, it is NOT ready for the client. Really, really not ready for the client.",
"Today, my girl and I were in bed trying to nap before class. She kept tossing and turning, obvious signs that she was having no luck. Sweetly, I ask her if there was anything I could do to help her relax. She says \"you can tell me a story about your day, that always puts me to sleep\".",
"Too lateToday, I bought a replacement ID after weeks looking for my old one and not finding it. When I got home, my brother said he'd found my ID.",
"Today, while waiting in line to get my medication, a man who just got his prescription looked me up and down and said \"Penis pills, right? Ya look like the type.\" Then he walked out as a couple of other guys in line started snickering.",
"Today, my cat used my head as a springboard and ripped my earring out with her claw.",
"Today, I parked next to a police officer's car in a bad part of town. When I got out, I saw a bag of pot on the ground between the cop's car and mine. When I pointed it out to him, he insisted it was mine and interrogated me to the point of tears.",
"Today, my flatmate was listening to opera on full volume all afternoon and now he's playing James Bond on the trumpet.",
"Today, after recently breaking up with my boyfriend, I unknowingly washed my laundry using his washing tabs. My whole wardrobe now smells like my ex.",
"Big baby manToday, I woke up to my apartment in a state of total disarray. I've been asking my boyfriend to get either get a job, or clean the house. I just had a bunch of dental work taken care of. He doesn't have a job, and doesn't want to find one. I'm tired of trying to raise an already grown man.",
"Today, the only man who has ever fallen in love with me is bald.",
"Today, in geometry class, we were working in dead silence. Apparently my phone wasn't on vibrate, and I received 25 texts all at once, while it blasted \"Hakuna Matataaaa\" out of my back pocket. They weren't even texts from friends, just Facebook notifications.",
"Today, I ran into a good friend at work. I work at a jail. She doesn't.",
"Today, I had to explain to my one person on my staff why having kids aged 6 to 9 hammering in screws with the butt end of a screwdriver is neither safe, nor a good idea.",
" Today, I told my boyfriend I was ovulating. He said he didn't want to have sex because he was afraid of getting eggs on his penis. He then compared it to having sex with a fish.",
"Today, my brother thought jumping out and punching me in the stomach would cure my hiccups. Yeah. Didn't work.",
"Today, I found out my stalker is my mom's new boyfriend.",
"Today, I noticed that my ceiling was sagging slightly. I got up on to a chair to look at it more closely, and I touched it. Turns out that my ceiling was full of water. It went everywhere, ruining my new iPod, phone, and all the things my daughter bought for university.",
"Today, my wife asked me to back up all the photos and videos from our desktop computer so I synced it with my Google account. Every graphic picture and video my wife and I have ever exchanged was sent to all 3 of our children's tablets. My daughter cried all night.",
"Today, we are once again in full COVID lockdown. I live in a tiny apartment, I'm pregnant and the only thing that helps me sleep is walking for an hour...",
" Today, my father-in-law decided to \"fix\" our bathtub and ended up flooding the bathroom. Later, in his attempt to clean things up, he walked, without permission,...",
"Forever alone, foreverToday, I realized that I've only had 3 men show interest in me: A blind man, a drunk, and a guy so desperate, he's been trying for over 5 years of solid \"No\"s. I'm 21.",
"Awkward pauseToday, a close friend called me to inform me of his newest relationship, and why he's kept it from me - he's been seeing his male cousin for several months and was tired of hiding it from the world. I had to keep my shock in check over the phone.",
"Today, after supporting QLD in the State of Origin for the last 20 years of my life, I found out that I was actually born in NSW.",
"Today, I found out my mom has been stealing from me to pay for Scientology courses.",
"Today, my boyfriend finally proposed. His reason? A Las Vegas wedding came up on Groupon.",
"Today, I was home alone in the dark and I heard the doorbell ring. I didn't know who it was so I didn't answer. They kept ringing, so I got a bit scared and called the police. When the police showed up, they told me it was a Chinese delivery guy with the wrong address.",
"Today, after my annoying neighbor who used to spend hours playing the cello in the apartment below me finally moved out, I found out that I have a new musical neighbor moving in. This fellow plays the bagpipes.",
"Today, I found out why my daughter eats so many sugary baked goods. According to her, when you bake things, all the sugar and calories are \"released\" and so you can't gain weight from it. It seems I raised a moron.",
"Today, I was babysitting a 7 year old girl and we were eating chocolate covered nuts. She kept on chewing the nuts and wondered where the chocolate was. I told her to taste the chocolate you suck on the nuts. Then her parents came home and the first thing she said was \"I learned how to suck nuts!\"",
"Today, we are once again in full COVID lockdown. I live in a tiny apartment, I'm pregnant and the only thing that helps me sleep is walking for an hour...",
" Today, I was getting dirty looks on the train whilst air strumming the guitar to a song on my iPod, after glancing at the reflection in the window I realized it looked like I was masturbating.",
"Today, my pregnant wife's parents called me at work, saying she'd been crying inconsolably and wouldn't say what was wrong. After pleading with my boss, I rushed home. Turns out there was an \"ugly\" sofa in a TV ad and she felt it was \"picking on ugly sofas\".",
"Today, I was sitting with my boyfriend watching the Super Nanny. He watches the show regularly and said he has learned some of her techniques. Apparently, he uses them on me when I'm acting irrational.",
" Today, I started my first day as a waitress. After getting my ass slapped, drinks and food spilled over me, and being tripped by a bratty kid, my tips were stolen.",
" Today, my father-in-law decided to \"fix\" our bathtub and ended up flooding the bathroom. Later, in his attempt to clean things up, he walked, without permission,...",
"Today, I ran into my sister, who nobody in the family has seen in six years. She looked very happy working the pole.",
"Thanks for your concernToday, my sister called after she found out I was hospitalized with surgery complications. Worried about me? Wondering if I'm okay? Nope. Just mad that I texted her an update rather than calling. I didn't call because I had surgery on my throat and can't speak.",
"Today, my wife gave me back my camera which she took on vacation to visit her parents with our 2-year old. I noticed the picture sequence had big gaps in the numbering. I ran an undelete on the card, and found 80+ pictures of her naked with another guy in her mom's bedroom.",
"TMIToday, I had a conversation with another patient in my gyno's waiting room. It was about her getting pregnant in a truck while passed out drunk, her therapist's frequent use of a \"For Dummies\" books, and how she had waxed and oiled everything to impress our doctor.",
"Today, I am sick with a cold and I go to the most important interview of my life. A giant glob of wet snot comes out of my nose when I am expressing my desire to join their team.",
"Today, I was out jogging. As I took a rest to have a drink of water, a car pulled onto the sidewalk and bumped into me. Not just any car; my dad's car. He then drove away.",
"Today, it's my Nana's birthday and to say she is having a good time is an understatement. She's so drunk, she took out her false teeth tried to put them in her dog's mouth. When she failed, she tried the cat's.",
"Today, my 53 year-old art teacher told me she's excited about going clubbing this weekend. I'm excited about watching a special on the History Channel.",
"Today, I signed up for an online dating site. In order to prove I was human and complete my registration, I had to pass a CAPTCHA. Coincidentally enough, the words in it were \"depressed\" and \"loser\".",
"Today, I was leaving the mall. I Instinctively hit the unlock button on my car keys from across the parking lot. Little did I know I was making it a whole lot easier for the guy breaking into my car.",
" Today, I had my new girlfriend over for dinner. Halfway through the meal, my dad started poking her with his fork. When I asked him what the hell he was doing, he barked back, \"Just making sure she isn't a blow-up doll!\"",
"Today, my boss called me to say that I've been slow at work this week and that I will be replaced if I don't pick up the pace. That would be understandable, if I didn't have a broken ankle and pneumonia.",
"Today, I noticed that my dad scolds me in the same tone of voice that he uses to scold our two dogs. Gives a whole new meaning to being treated like a dog.",
"Today, my husband cancelled our internet and cable package because we’re having money problems. I work from home and need the internet to do so. I guess getting a job of his own wasn’t an option.",
"Today, after supporting QLD in the State of Origin for the last 20 years of my life, I found out that I was actually born in NSW.",
" Today, my now ex-boyfriend was kind enough to let me live on the couch because I have nowhere to go. I have to see the homewrecker he cheated on me with...",
"Sounds healthyToday, a girl that I've been falling for told me that she's married. But not to worry, that \"won't get in the way of 'us'.\"",
"Today, I took my girlfriend of three years on a romantic picnic to the park, so I could propose to her. The moment was just right, I made my move. I knelt down on one knee and asked her. Her response was \"you're kneeling in dog poop.\" I looked down. She was right.",
"Today, I found out why I haven't been getting my bank statements for the past couple of months. My parents have been hiding them from me, because they've been stealing from it.",
"One law for me…Today, I got disciplined for sleeping on night shifts, by my boss, who also sleeps on night shifts.",
" Today, I found out the hard way, that yes, a condom can break. Also, that sometimes when it does, your boyfriend won't say anything until you start having morning sickness.",
"Today, I got married on Skyrim. To an elf. While in real life, my love life is floundering like a half-dead carp in the surf on a hot day. So much so in fact that I actually draw a measure of comfort from being married to an elf.",
"Today, I rushed onto the metro to get to work. I found there were no seats left and asked a perfectly healthy guy to let me sit in the handicap spot. He refused to because \"being tired\" was a handicap characteristic. I have one leg.",
"Today, my mum and I were walking down a road where we met an old neighbour who recently got divorced. Her son who we hadn't seen for about 10 years was with her and he looked very handsome. I said, \"oh wow ! your son has grown up so much !\" The woman replied, \"this is my boyfriend.\"",
"Today, I went to Uni. I woke up at six and got to the station as the train was leaving. I was congratulating myself on my brilliant skill when, as we passed the carpark, I saw I had left my headlights on. It later cost more for the lead to jump start my car than it would have to drive to Uni myself.",
"Today, I let my dad borrow my car. I found out a few hours later that he has had a suspended license for three years. How did I find out? He got pulled over and arrested. My car was also impounded. I'm a college student barely making it as it is. Guess who can't afford the impound fees?",
"Today, we are once again in full COVID lockdown. I live in a tiny apartment, I'm pregnant and the only thing that helps me sleep is walking for an hour...",
"Dog hater?Today, I had a phone interview for a better position at work. I've been training my puppy recently not to bark. I put on dog-calming videos while she was in the kennel. During the interview, my neighbor's dog started barking and my dog immediately responded back. My boss ended the interview.",
"Today, I was fired without warning from my job because I was not consulting my boss about things like washing dishes and throwing away garbage. Basically, I was fired for being too good at my job.",
"Today, it hit me that I'm incredibly pathetic, when at the age of 21, I tucked my stuffed animals into bed with me, facing in different directions so they could keep watch for monsters while I slept.",
"Today, I bit into a Reese's Cup that had been sitting on my desk for a while. As I did, half of a yellow meal worm fell out and landed in front of me, the other half was in my mouth. It was wiggling.",
"Today, my boyfriend's mother who lives with us decided that since I work from home, it would be a good idea for her to stay home and keep me company. \"Keeping me company\" includes ordering me to make her food, gossiping non stop, and ridiculing me for not being the woman that she always saw her son marrying.",
"Stuck in the middle with youToday, I had to beg and argue with my boyfriend to get him to take a shower and brush his teeth. This has become a recurring argument now we're confined together.",
" Today, I was getting dirty looks on the train whilst air strumming the guitar to a song on my iPod, after glancing at the reflection in the window I realized it looked like I was masturbating.",
" Today, my father-in-law decided to \"fix\" our bathtub and ended up flooding the bathroom. Later, in his attempt to clean things up, he walked, without permission,...",
"Bad timingToday, I learned that the one face cleaner that actually works for me is no longer being made. I just ran out of the last of my supply last night, and I woke up to find my face completely covered in zits.",
"Today, my dad decided that he shouldn't have to wear clothes in the privacy of his own home.",
"Today, after several sleepless nights full of crying, I went to my university's free help center. After telling the psychologist my problems and asking what to do, he looked at me blankly and said, \"Uh, it's not depression, I guess. You should go out more and, like, party some more.\"",
"Today, after months of searching and several emotional breakdowns, I finally found a new job. My wife's words of encouragement? \"Try not to fuck this one up.\"",
"Today, I ran into my ex's family, and found out they are going to Europe. Funnily enough, so am I. Even funnier is the fact that we are going on the same date, at the same time, on the same flights, and the tour starts on the same day in the same place.",
" Today, I took my new boyfriend to a family dinner. Despite having made everyone agree to be on their best behavior, my grandma spewed obscenities such as \"fuck me sideways, aren't you a catch?\" and \"you just can't pull ass like that at my age\" throughout.",
"Today, my sister and I were planning a trip to get away from things and visit some faraway friends. My dad then decided to insert himself into our plans. He got mad when we said no, and couldn't understand why we wanted to go by ourselves.",
"Today, I finished a 2 hour Skype call with my girlfriend, only to realize I was using mobile data.",
"Today, I was woken up to the sound of my cat peeing on the pillow next to mine. When I yelled at him, he jumped over my face and off the bed. He was still peeing the entire time.",
"Today, we are once again in full COVID lockdown. I live in a tiny apartment, I'm pregnant and the only thing that helps me sleep is walking for an hour...",
"Today, my mother excitedly jumped up and down, announcing that one of her sweet younger coworkers got engaged. I wished she'd had the same reaction to my engagement when I announced it to her a few days earlier.",
"Today, while driving, I witnessed the neighbors dog viciously shaking a black cat. So I slammed on the brakes and jumped out of the car, frantically chasing around the huge dog screaming \"Help, someone please help!\" I finally managed to tackle him and release the cat. It was a stuffed animal.",
"Today, I went to a tattoo artist to get what I thought would be really cute, elegant finger tattoos. I left with wobbly, blobby messes all over my fingers.",
"Today, I found out that my wife of 5 years has decided to change everything: job, clothes, hair style, car, and me.",
"Today, I was on the worst blind date ever, so I tried to secretly request an Uber to get out of there. My date then picked up his phone, receiving my request. Turns out he's an Uber driver and he was looking for a reason to get out of the date too.",
"Today, after supporting QLD in the State of Origin for the last 20 years of my life, I found out that I was actually born in NSW.",
"Today, I was T-boned at an intersection. In an ambulance. On the way to the hospital after being T-boned at an intersection.",
"Today, my house key jammed inside the lock, which would've been annoying even if I hadn't been desperately running from my neighbor's psycho pitbull at the time.",
"Today, after supporting QLD in the State of Origin for the last 20 years of my life, I found out that I was actually born in NSW.",
"Today, I was taking a dump and I pushed so hard that I got light headed and passed out on the floor.",
"Today, I found out my boyfriend has been cheating on me. In tears, I called my best friend and told him everything. He responded with one- or two-word answers throughout, but I felt better all the same. That is, until I heard him begin to take a loud piss half-way through my sentence.",
"Today, after working alone in a room all day, I let a fart sneak out. Just then, my drop dead gorgeous boss and two new girls walked in. I could literally see them hit the stench and cringe.",
"Today, I walked into the dining room to find my mom popping pimples on my dad's back.",
"Today, we had an emergency lockdown in my gym class. As a result, we had to go into the boys' locker room, so naturally, it smelled like a fart in there. Some dumbass had a \"brilliant\" idea to spray a WHOLE FUCKING CAN OF AXE SPRAY in the locker room. I have asthma.",
"Today, I got home early from work at 2am to find my girlfriend of 5 years missing. Upon further inspection, I caught the \"other man\" dropping her off out front. So much for the engagement ring I bought for her.",
"Today, my mom was more upset about my 67 on an Algebra test than my sister almost setting the house on fire.",
" Today, I was having the best sex with my husband, and right when I reached climax, he shouted \"Abracadabra!\"",
"The GraduateToday, I graduated with my Bachelor's degree. The excitement didn't last too long because I broke my elbow by tripping over a stick at my graduation dinner. Definitely not intoxicated, just clumsy.",
"Today, I found out why my District Manager won't promote me to store manager; his wife thinks he's having an affair with me. If he promotes me, she will take that as evidence of the affair, and then will threaten to divorce him.",
" Today, my father-in-law decided to \"fix\" our bathtub and ended up flooding the bathroom. Later, in his attempt to clean things up, he walked, without permission,...",
"Today, my girlfriend broke up with me because \"God\" told her to. I guess \"God\" didn't have any problems with me buying dinner first.",
"Today, I'm the coach of a football team. To celebrate winning a game, they poured a cooler of blue Gatorade over my head. This would've been great, if not for the fact that I'm highly allergic to blue food dye.",
"Today, I heard my ten-year-old brother say, \"Are hamburgers a reptile?\"",
"Today, after receiving the third call this week from teachers about my son falling asleep in class, I decided that it would be a good idea to hide his Xbox controllers. He decided it would be a good idea to hide my diabetes medication.",
"Not the oneToday, my ex, who I'm still love with, told me he's engaged. We weren't together for long because he didn't want a committed relationship. Guess it was just me.",
"Today, we are once again in full COVID lockdown. I live in a tiny apartment, I'm pregnant and the only thing that helps me sleep is walking for an hour...",
" Today, while my friend and I signed the guest-book at a wedding, the drunk guy at our table stole my friend's painkillers and car keys before getting into a cab. Didn't need the painkillers, definitely needed the keys.",
"Today, I had a job interview with a man that I got drunk with at a bar on Saturday night. He spent an hour telling me things I did that I don't even remember.",
"Today, after supporting QLD in the State of Origin for the last 20 years of my life, I found out that I was actually born in NSW.",
"Today, for the very first time, I invited my girlfriend's parents for dinner. I bought a pre-made oven dish, just to be sure nothing could go wrong. Once at the table, her mother asked pointedly who forgot to remove the plastic foil before putting it in the oven.",
"\"Nice alarm you've got there\"Today, I woke myself up by pinching my nipple between my elbow and the bed. This isn’t the first time.",
"Today, I went to my high school reunion. Someone walked up to me and said, \"Wow, you look so different!\" She then followed it up with, \"You used to be so pretty, what happened?\"",
" Today, I discovered that my boyfriend has been having an intimate text exchange with a woman. She's the grieving widow of his friend who died three weeks ago.",
"Today, I received a single, hand-made Valentine's card from the weirdest kid in the school. It said, \"If you ever get mauled by a bear, I hope he doesn't damage your face.\"",
"Awkward...Today, I went to this coffee shop in town that has a fire pit outdoors with my boyfriend. I threw out the idea of sitting by the fire together, and he responded by telling me that his father and dog died in a house fire when he was young.",
"Today, I found out that my \"mosquito bite\" was in fact a jellyfish sting I got in Mexico, which has caused me to break out into horrendous hives in the airport waiting for the flight home. It's okay though, the plane is only delayed for 7 hours.",
"Today, I tried to back out of a spot in a parking garage. I did a 12 point turn, hit the car behind me and still didn't manage to get out of the spot. Everyone was staring at me, and the attendant had to come over and move my car for me. I have to park there every day.",
"Today, my husband tried to be romantic by throwing me in a bed laid with roses. Too bad he forgot to remove the thorns first.",
"Today, a girl called me asking for one of her friends. She wouldn't believe me when I told her she had the wrong number, and I spent a few minutes convincing her she did. After a while she said \"what the fuck\" and hung up. That was the longest conversation I had with a girl in months.",
"Check this outToday, while on a date, I went to take a sip of my drink, but for some reason I expected a straw to be there. I ended up wiggling my tongue and mouth around my glass looking for it as I kept my eyes on my date. It must've looked like I was trying to be seductive in the creepiest way possible.",
"Today, 5 minutes before closing, a customer was taking a bike from the row while I helped someone else. The customer ended up pushing the whole row down and left instantly without even apologizing. It took me about an hour to pick up the bikes and check for damage.",
"Today, I was looking through some old family photos. I don't know what the hell was going on in my head, but I idly double-tapped on one to zoom in. They were prints.",
"(facepalm)Today, while working roadside assistance, I arrived to a bewildered client who couldn't find their spare tire. The vehicle in question was a Jeep. I pointed out the spare, but was corrected as \"that's just for decoration.\"",
"Today, I told my girlfriend that my identical twin and I are not in fact related, that he's adopted, and that the only reason we look exactly the same is because we eat and drink the same things. She actually believed it.",
" Today, I ran full speed into a brick wall because I saw a tiger. On the other side of a zoo cage.",
"Today, my cat jumped out a fourth-story window when I went to pet her.",
" Today, my grandmother gave me a huge speech on being abstinent until marriage. Being the honest person that I am, I told her I wasn't a virgin anymore. Instead of being mad and telling me I was going to hell. She asked me what my favourite things to do sexually were. And told me hers in detail.",
"Today, my girlfriend changed our cable subscription to include MTV. This made us lose the only channel I care about: HBO. Goodbye Game of Thrones, hello Teen Mom.",
"Today, I decided to dress up a little to go out to the bar. I put on a nice shirt, some leggings and heels. When I walked out the door my dad said that I looked like a whore. When I got to my boyfriends house I told him what my dad had said and he replied \"I'd have to agree with him.\"",
"Today, I realised I can tell which family member has just left the bathroom from the smell alone.",
" Today, my father-in-law decided to \"fix\" our bathtub and ended up flooding the bathroom. Later, in his attempt to clean things up, he walked, without permission,...",
"Today, I found out my boyfriend was cheating on me using LinkedIn, a platform people use to connect with potential employers.",
"Today, while working at Home Depot, a customer tried to engage me in a conversation about which gardening tool would \"hypothetically\" be the best to kill his wife with.",
"Today, I woke up with a swollen lump on my throat. It's extremely painful. My dad named it Gretchen and now talks about it as if it's a person.",
"Today, my girlfriend's ex punched me so hard in the face, I couldn't see straight. But I got up anyway. I lunged at him, and nailed him in the jaw. Turns out I'd in fact just knocked out my girlfriend the on-looker.",
"Today, I was playing around on Photo Booth, using weird effects on pictures of myself. I clicked on one and thought to myself that it was a really ugly effect. Then I noticed that it was set on normal.",
" Today, my now ex-boyfriend was kind enough to let me live on the couch because I have nowhere to go. I have to see the homewrecker he cheated on me with...",
"Today, I caught my elderly neighbour skinny-dipping in my pool.",
"Today, I spent ten minutes looking for my cell phone in the dark, only to realize the light I was using was my cell phone's.",
"Today, my best friend told me she's been in love with me for over 4 years. I'm getting married to the man of my dreams in a month and she's supposed to be my bridesmaid. \"Awkward\" doesn't even begin to describe our friendship right now.",
" Today, I applied some things I learned reading a \"How to please a woman\" book. My wife was in heaven until it was over, then she started crying and yelling about the only way I would learn those things is if I was having an affair. I explained but she doesn't believe me.",
"Today, I played charades with my girlfriend and her family. When it was her turn to act out a phrase, she simply walked to the center of the room and pointed to herself and then at me. It took less than 5 seconds for someone to correctly guess \"Beauty and the Beast\".",
"Today, I teach English in Taiwan. I got two new students, brothers named Harry and Potter. People, they're children, not pets.",
"Today, I found out my 8th period science teacher got fired. Our final is tomorrow.",
"Today, I got rear-ended at a stoplight by a woman who had been doing her make-up while driving. She didn't get out to see if I was okay until she had finished perfectly applying both lipliner and gloss.",
"Today, my grandma moved in with us. Along with her 36-year-old boyfriend that none of us knew about.",
"Today, my girlfriend dumped me for no real reason via text message. A few hours later, she updated her relationship status on Facebook to \"in a relationship.\" Her new \"boyfriend\"? Her cat. A mutual friend commented, \"Well, he's better than that idiot you had before.\"",
"Today, the bank I use lost 5 billion.",
"Stay Safe!Today, the cruise that I was looking forward to for over a year was cancelled due to the coronavirus. Trying to salvage what was left of my vacation, I booked a hotel for a few days near a local beach. They just announced that the beach was closed and the hotel is refusing to refund my money.",
"Today, my husband received a package in the mail containing a bottle of billiard ball cleaner for our pool table. Yes, billiard ball cleaner. I can't get that slovenly wretch to clean a toilet to save his life, but now he's determined to have the shiniest balls on the block.",
"Today, I got in trouble for missing my shift. According to my idiot boss, \"Crashes don't just happen.\"",
"Today, I asked the restaurant manager if he could arrange to deliver an engagement ring to me and my girlfriend with our desserts. Desserts came, no ring. That guy wasn’t the manager, just a guy in a suit who legged it with my ring.",
"Today, we are once again in full COVID lockdown. I live in a tiny apartment, I'm pregnant and the only thing that helps me sleep is walking for an hour...",
"Today, my daughter found a hair baked into the crust of her pizza. Grossed out, she put it down the garbage disposal, but I told her to dig it out so we could get a refund. After dinner, she came looking for the saved pizza crust. I was baffled about where it was until I realized I'd eaten it.",
"Today, my son turned 8. We watched as he unwrapped a $55 Nerf gun, extra 'bullets', new shoes and a school bag with his favorite TV character on the front and a action figure inside. As he finished he looked me straight in the eyes and says, \"That's great ma, but seriously what'd you get me?\".",
" Today, my boyfriend and I had sex for the first time. After what seemed like an eternity of waiting, he finally entered me, then paused and asked me, \"what do I do now?\"",
"Last act Today, while making out with my boyfriend of a month, he started rubbing my boobs. He told me that he wanted to get some action before he broke up with me.",
"Today, after our housing offer was accepted, I told my parents. The only response was, “That’s a much nicer house than I had when I got married, I hope you can afford furniture.” Thanks mom.",
"Today, I went to the location of me and my wife’s first date, because I miss her and barely get to see her because of our work schedules. Only to see her there on a date.",
"Today, is the 6 month anniversary of my boyfriend and I. Turns out next month he will be celebrating the 3 year anniversary of him and his wife.",
"Awkward pauseToday, a close friend called me to inform me of his newest relationship, and why he's kept it from me - he's been seeing his male cousin for several months and was tired of hiding it from the world. I had to keep my shock in check over the phone.",
" Today, my girlfriend suggested we start using a safe word during sex - not because we're into BDSM or anything like that, it's just in case she gets bored and wants me to stop.",
"Today, I graduated with a CS degree and a certification in networking, only to make $12/hr. Guess some trade jobs are worthless now.",
"Today, my family and I were visiting an aunt. While helping my aunt to set the table, my sister remarked that from behind I look exactly like her. I reflexively blurted out \"well fuck you too\". Very awkward silence.",
"Today, after supporting QLD in the State of Origin for the last 20 years of my life, I found out that I was actually born in NSW.",
"Today, our school went to an elementary school to read to the kids. One of the girls in my group asked me if she could switch into another group, so I asked her what was wrong with mine. She said, \"Nothing, I wanna be in her group. She's prettier.\" I was insulted by a kindergartner.",
" Today, I was talking to a hot girl at the bus stop. She seemed interested in me and I was feeling a connection forming. When the bus came, I offered to let her board first, but she said it \"wasn't her bus\" and said goodbye. Later, I realized I'd spent 20 minutes making moves on a prostitute.",
"Today, I woke up to my brother chopping all my bangs off. When I yelled at him, he could only shout back, \"You can see clearly now, the bangs are gone!\"",
"Today, I sat my son down for the sex talk. By the time it was over, he'd corrected me on several factual errors and told me what felching is. Now I remember why I never wanted kids.",
"Today, I told my brother to piss off. He decided to do exactly that, from the balcony onto my lap.",
"Today, my crush and I were volunteering at a local farm. He confessed to me that I'm one of the most beautiful girls he's ever seen. Just as he leaned in to kiss me, I lost my footing and fell into a pile of horse shit. He just stood there, pointing and laughing.",
"Zoom this, bitches!Today, my younger son was doing a Zoom meeting for his upcoming school orientation. I tried to hold it in, but I stepped away for a moment to run to the restroom. My older son thought it’d be a hilarious \"prank\" to moon the camera. School hasn’t even started and we're already the \"problem family\".",
"Oversharing Today, my 10-year-old son told me that sometimes he wishes that he could be a girl, so that he could masturbate more easily in public.",
"Today, in an attempt to be more healthy, I made myself a large fruit smoothie. I didn't think it could or would cause me to practically shart my rectum out my ass for the rest of the afternoon. The more you know.",
"Completely wetToday, I was drinking too much and I have to pee constantly, so I went to bed without my girlfriend. Hours later she woke me up wanting sex, but she realized that I pissed the bed.",
"Today, I was at a pet store cuddling an apparently overaggressive chinchilla when it decided to bite me and run out of my hands. It is now nowhere to be found and I have to pay for it.",
"Today, I discovered that my obese 57-year-old mother’s flat-out refusal to close the door when she uses the bathroom doesn’t change even when I have friends over.",
"Today, my mom's boss reversed into my parked car. She expects me to say that it's my fault so she doesn't have her insurance increase.",
"Today, my car was rear-ended and totaled. Last year, during the same month, my previous car was rear-ended and totaled. I should just stop driving during the month of February.",
"Today, I after getting off the bus, I realized that the man I was talking to was distracting me so his \"buddy\" could steal my wallet.",
" Today, my now ex-boyfriend was kind enough to let me live on the couch because I have nowhere to go. I have to see the homewrecker he cheated on me with...",
"Today, I walked into a really fancy hotel bathroom. I spoke to the attendant and gave her my purse and coat while I used the toilet. When I came out, she was gone. The receptionist informed me they didn't have a bathroom attendant.",
"Today, I decided to make a toaster scramble. I thought it was bad enough when the pastry fell through the grate in the toaster over. Then it burst into flames. After 5 minutes of fanning the smoke away from the smoke detector, it still went off. Now my entire dorm building is outside in a snowstorm.",
"Today, I was accused of being a racist whore at work. I had asked a man if he needed help finding anything, as that is part of my job.",
"Today, my crush was walking up to me and I put my earphones in, playing hard to get. When I heard him say something about a date I take an earphone out and say, \"Oh, I didn't see you there!\" His response, \"They're not connected to anything,\" holds up the end of my earphones and walks away.",
" Today, my father-in-law decided to \"fix\" our bathtub and ended up flooding the bathroom. Later, in his attempt to clean things up, he walked, without permission,...",
" Today, I got in an argument with my boyfriend, who recently had to move away, about not calling enough. Apparently his moving had meant that we were now taking a break, he just forgot to talk it over with me. He still wants to visit, and keep the relationship in bed alive though.",
"Today, my boss is out of the office and sent me an e-mail asking me to multiply two numbers together and send her the result. Apparently she doesn't know that her smartphone has a calculator app.",
"Today, I didn't have my key, so my sister told me to call her to let me in. I called, no answer. I waited for 15 minutes and then called my dad complaining about her, still being outside. She popped her out the window and yelled, \"Don't talk about me, bitch!\" and wouldn't open the door.",
"Freudian slipToday, while hugging my sister's husband, I accidentally let out a \"Mmm…\" sound in front my whole family.",
"Today, my motorcycle was stolen. If that wasn't bad enough, the thief drove past me. Twice.",
"Today I started a new job, I found out that my employer doesn't follow the labour laws and my new co-workers are planning on reporting the owner of the company. The owner is my father, and I want to help them report him.",
"It's complicatedToday, I was screamed at for not doing the dishes because I was exhausted. Last year, when my arm was broken, I did all my chores without complaint. I don’t know how to explain to my parents that I’d much, much rather work with a broken arm than while tired.",
"Today, I noticed that my clothes had shrunk. My mother seemed to be having trouble with the new washer and dryer so I tried to show her exactly how they work. After my explanation she said \"I know how they work. I shrank your clothes to give you some incentive to lose all that belly you got.\"",
"Today, my 7-year-old sister had a nightmare, so I let her sleep in my bed. I woke up to her punching me in the face and giving me a black eye. Apparently, she not only screams when she's having a nightmare, she also \"gives the bad guy a taste of his own medicine.\"",
"Today, I found out that if you fall asleep in church, people will think you're having a spiritual moment, and you'll wake up to ten people praying for you.",
"Today, my very traditional grandmother has decided it's time for me to get married to Kevin. She's called half the town and informed them of the good news. I'm 17. I've never met Kevin.",
"Today, I helped myself to a small glass of cocktail from the fridge, not realising it was alcoholic. I told my mom what happened. She made me drink salty water until I vomited so I wouldn't get \"alcohol poisoning\". I'm 19.",
"Today, I proudly told my family I lost 15 pounds. My dad looked me up and down and said, \"Well, you've got a looooong way to go."
]