[
    {
        "quotes": "Jujur aku juga memiliki perasaan terhadapmu dan tidak bisa menolakmu tapi aku juga takut untuk mencintaimu",
        "author": "rafiadichandra_"
    },
    {
        "quotes": "Butuh waktu untuk mendapatkan orang yang tepat",
        "author": "rafiadichandra_"
    },
    {
        "quotes": "Orang pesimis melihat kesulitan di setiap kesempatan. Orang yang optimis melihat peluang dalam setiap kesulitan",
        "author": "rafiadichandra_"
    },
    {
        "quotes": "Kalau jadi ksatria itu gampang Yang susah itu jadi pahlawan hati kamu",
        "author": "rafiadichandra_"
    },
    {
        "quotes": "Hidup itu susah, tapi kamu tidak sendiri. Banyak yang lebih buruk darimu, tapi mereka bisa bertahan",
        "author": "ChandraSans"
    },
    {
        "quotes": "Tidak ada kata terlambat untuk menjadi dirimu yang seharusnya",
        "author": "IceBoy"
    },
    {
        "quotes": "Setiap anak memang berhak pulang kerumah,tapi tidak semua rumah memiliki cerita yang indah🍂",
        "author": "Cebby"
    },
    {
        "quotes": "Ubah pikiranmu dan kamu akan mengubah duniamu.",
        "author": "Norman"
    },
    {
        "quotes": "Kamu telah merubah diriku, dan aku tidak akan pernah melupakan itu.",
        "author": "Chava"
    },
    {
        "quotes": "Aku tahu banyak kata-kata terakhir, tapi aku tidak tau kata-kata terakhirnya",
        "author": "Chava"
    },
    {
        "quotes": "Aku tidak pernah menjadi sesuatu yang penting bagi seseorang. Bahkan untuk diriku sendiri.",
        "author": "Chava"
    },
    {
        "quotes": "Aku memang diam,tapi aku tidak buta.",
        "author": "Chava"
    },
    {
        "quotes": "perjalanan seribu mil dimulai dengan satu langkah.",
        "author": "Chava"
    },
    {
        "quotes": "persetan dengan kesehatan, dan ketenangan lebih penting.",
        "author": "Chava"
    },
    {
        "quotes": "Jadilah\ndirimu sendiri. Orang tidak harus menyukaimu, dan kamu tidak perlu peduli",
        "author": "Chava"
    },
    {
        "quotes": "Kesepian terburuk adalah tidak nyaman dengan diri sendiri.",
        "author": "Chava"
    },
    {
        "quotes": "Hidup akan sangat indah jika kamu tahu manakah jalan yang benar.\"",
        "author": "Chava"
    },
    {
        "quotes": "Saya sudah cukup tahu bagaimana sifatmu itu kamu hanya dapat memberikan harapan palsu kepadaku",
        "author": "rafiadichandra_"
    },
    {
        "quotes": "Sendiri itu tenang tidak ada pertengkaran kebohongan dan banyak aturan",
        "author": "instagram.com\/rafiadichandra_"
    },
    {
        "quotes": "Hargailah orang sabar, karena orang sabar bisa pergi tanpa kabar",
        "author": "ChandraSans"
    },
    {
        "quotes": "Lihat kebunku, penuh dengan bunga Lihat matamu, hatiku berbunga-bunga",
        "author": "@jiakhh"
    }
]